app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def show
    @article = Article.friendly.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`, `slug`) VALUES ('Ababa', '3213214124', '2022-05-07 23:45:53.297046', '2022-05-07 23:45:53.297046', 'public', 'ababa')
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
  def edit
    @article = Article.friendly.find(params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`body` = 'hewllohgjmghjhgjgh', `articles`.`updated_at` = '2022-05-09 11:13:24.848615', `articles`.`status` = 'public', `articles`.`slug` = '2' WHERE `articles`.`id` = 2
---
  def update
    @article = Article.friendly.find(params[:id])

    if @article.update(article_params)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 6
---
  def destroy
    @article = Article.friendly.find(params[:id])
    @article.destroy